tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
bool parseBoolParam(const char* name) {
    char value[8];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value))) {
        return false;
    }
    return strcmp(value, "1") == 0 || strcmp(value, "on") == 0 || strcmp(value, "true") == 0;
}

bool parseU32Param(const char* name, uint32_t minValue, uint32_t maxValue, uint32_t fallback, uint32_t& out) {
    char value[16];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value)) || value[0] == '\0') {
        out = fallback;
        return true;
    }
    char* end = nullptr;
    const unsigned long parsed = strtoul(value, &end, 10);
    if (end == value || *end != '\0' || parsed < minValue || parsed > maxValue) {
        return false;
    }
    out = static_cast<uint32_t>(parsed);
    return true;
}

bool parseU8Param(const char* name, uint8_t minValue, uint8_t maxValue, uint8_t& out) {
    uint32_t parsed = 0;
    if (!parseU32Param(name, minValue, maxValue, 0, parsed)) {
        return false;
    }
    out = static_cast<uint8_t>(parsed);
    return true;
}

bool parseMinuteParam(const char* name, bool enabled, uint16_t& out) {
    char value[8];
    if (!Esp32BaseWeb::getParam(name, value, sizeof(value)) || value[0] == '\0') {
        out = kInvalidMinuteOfDay;
        return !enabled;
    }
    if (strlen(value) != 5 || value[2] != ':' ||
        value[0] < '0' || value[0] > '9' ||
        value[1] < '0' || value[1] > '9' ||
        value[3] < '0' || value[3] > '9' ||
        value[4] < '0' || value[4] > '9') {
        return false;
    }
    const uint8_t hour = static_cast<uint8_t>((value[0] - '0') * 10 + (value[1] - '0'));
    const uint8_t minute = static_cast<uint8_t>((value[3] - '0') * 10 + (value[4] - '0'));
    if (hour > 23 || minute > 59) {
        return false;
    }
    out = static_cast<uint16_t>(hour) * 60U + minute;
    return true;
}

void minuteToText(uint16_t minuteOfDay, char* out, size_t len) {
    if (!isValidMinuteOfDay(minuteOfDay)) {
        snprintf(out, len, "");
        return;
    }
    snprintf(out, len, "%02u:%02u", minuteOfDay / 60U, minuteOfDay % 60U);
}

void epochToText(uint32_t epoch, char* out, size_t len) {
    if (epoch == 0 || !Esp32BaseTime::formatEpoch(epoch, out, len, "%Y-%m-%d %H:%M")) {
        snprintf(out, len, "无");
    }
}

void sendEscapedValue(const char* value) {
    Esp32BaseWeb::writeHtmlEscaped(value != nullptr ? value : "");
}

void sendChecked(bool checked) {
    if (checked) {
        Esp32BaseWeb::sendChunk(" checked");
    }
}

void sendToggleInput(const char* name, bool checked) {
    Esp32BaseWeb::sendChunk("<label class='ir-toggle'><input type='checkbox' name='");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("' value='1'");
    sendChecked(checked);
    Esp32BaseWeb::sendChunk("><span></span></label>");
}

void sendTextInput(const char* name, const char* value, uint8_t maxLength) {
    char buf[192];
    snprintf(buf, sizeof(buf), "<input name='%s' maxlength='%u' value='", name, maxLength);
    Esp32BaseWeb::sendChunk(buf);
    sendEscapedValue(value);
    Esp32BaseWeb::sendChunk("'>");
}

void sendNumberInput(const char* name, uint32_t value, uint32_t minValue, uint32_t maxValue) {
    char buf[128];
    snprintf(buf, sizeof(buf), "<input type='number' name='%s' min='%lu' max='%lu' value='%lu'>",
             name,
             static_cast<unsigned long>(minValue),
             static_cast<unsigned long>(maxValue),
             static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(buf);
}

void sendSettingToggle(const char* title, const char* desc, const char* name, bool checked) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendToggleInput(name, checked);
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendSettingNumber(const char* title,
                       const char* desc,
                       const char* unit,
                       const char* name,
                       uint32_t value,
                       uint32_t minValue,
                       uint32_t maxValue) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendNumberInput(name, value, minValue, maxValue);
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>");
    Esp32BaseWeb::sendChunk(unit);
    Esp32BaseWeb::sendChunk("</span></div></div>");
}

void sendSectionStart(const char* title, const char* note) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</h3><p class='ir-section-note'>");
    Esp32BaseWeb::sendChunk(note);
    Esp32BaseWeb::sendChunk("</p><div class='ir-setting-list'>");
}

void sendSectionEnd() {
    Esp32BaseWeb::sendChunk("</div></div>");
}

uint32_t maxZoneDurationMinutes();

void sendEnabledPill(bool enabled) {
    Esp32BaseWeb::sendChunk(enabled ? "<span class='ir-pill on'>启用</span>" : "<span class='ir-pill'>禁用</span>");
}

uint32_t durationMinutesRounded(uint32_t seconds) {
    return (seconds + 59UL) / 60UL;
}

uint8_t planEnabledZoneCount(const IrrigationConfig& config, const WateringPlan& plan) {
    uint8_t count = 0;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled && plan.zoneDurationSec[i] > 0) {
            ++count;
        }
    }
    return count;
}

uint32_t planTotalDurationSec(const IrrigationConfig& config, const WateringPlan& plan) {
    uint32_t total = 0;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled) {
            total += plan.zoneDurationSec[i];
        }
    }
    return total;
}

void sendPlanStartSummary(const WateringPlan& plan) {
    bool any = false;
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        if (!plan.startTimes[i].enabled || !isValidMinuteOfDay(plan.startTimes[i].minuteOfDay)) {
            continue;
        }
        if (any) {
            Esp32BaseWeb::sendChunk(" / ");
        }
        char text[8];
        minuteToText(plan.startTimes[i].minuteOfDay, text, sizeof(text));
        Esp32BaseWeb::sendChunk(text);
        any = true;
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("未设置");
    }
}

bool readRequestZoneId(uint8_t& zoneId) {
    return parseU8Param("id", 1, kMaxZones, zoneId);
}

bool readRequestPlanId(uint8_t& planId) {
    return parseU8Param("id", 1, kMaxPlans, planId);
}

bool readPagingParam(const char* name, uint32_t minValue, uint32_t maxValue, uint32_t fallback, uint32_t& out) {
    return parseU32Param(name, minValue, maxValue, fallback, out);
}

bool readPlanFieldsFromRequest(WateringPlan& plan) {
    char value[kPlanNameLength];
    plan.enabled = parseBoolParam("enabled");
    if (Esp32BaseWeb::getParam("name", value, sizeof(value))) {
        snprintf(plan.name, sizeof(plan.name), "%s", value);
        plan.name[sizeof(plan.name) - 1] = '\0';
    }

    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "se%u", i);
        const bool enabled = parseBoolParam(key);
        snprintf(key, sizeof(key), "st%u", i);
        uint16_t minuteOfDay = kInvalidMinuteOfDay;
        if (!parseMinuteParam(key, enabled, minuteOfDay)) {
            Esp32BaseWeb::sendText(400, "启动时间无效");
            return false;
        }
        plan.startTimes[i].enabled = enabled;
        plan.startTimes[i].minuteOfDay = minuteOfDay;
    }

    for (uint8_t i = 0; i < kMaxZones; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "z%u", i + 1);
        uint32_t minutes = 0;
        if (!parseU32Param(key, 0, maxZoneDurationMinutes(), plan.zoneDurationSec[i] / 60UL, minutes)) {
            Esp32BaseWeb::sendText(400, "水路时长无效");
            return false;
        }
        plan.zoneDurationSec[i] = minutes * 60UL;
    }
    return true;
}

