tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::beginPanel("计划列表");
    Esp32BaseWeb::sendChunk("<div class='ir-toolbar'><p>计划只支持每日重复；启动时间和各水路时长在计划详情中配置。</p><a class='btnlink info' href='/irrigation/plans/new'>创建计划</a></div>");
    Esp32BaseWeb::sendChunk("<div class='ir-list'>");
    bool anyPlan = false;
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used) {
            continue;
        }
        anyPlan = true;
        char buf[256];
        Esp32BaseWeb::sendChunk("<div class='ir-list-row'><div class='ir-list-main'><b>");
        Esp32BaseWeb::writeHtmlEscaped(plan.name);
        Esp32BaseWeb::sendChunk("</b><small>每日计划，");
        sendPlanStartSummary(plan);
        Esp32BaseWeb::sendChunk("</small></div><div class='ir-list-cell'>");
        sendEnabledPill(plan.enabled);
        Esp32BaseWeb::sendChunk("</div><div class='ir-list-cell'><b>");
        snprintf(buf, sizeof(buf), "%u", planEnabledZoneCount(config, plan));
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk("</b><small>参与水路</small></div><div class='ir-list-cell'><b>");
        snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(durationMinutesRounded(planTotalDurationSec(config, plan))));
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk("</b><small>分钟总时长</small></div>");
        snprintf(buf, sizeof(buf), "<a class='btnlink info' href='/irrigation/plans/edit?id=%u'>配置</a></div>", plan.id);
        Esp32BaseWeb::sendChunk(buf);
    }
    if (!anyPlan) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>暂无计划。创建计划后，再配置每日启动时间和各水路时长。</div>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::sendFooter();
}

void handlePlanNewPage() {
    WateringPlan plan = {};
    plan.id = 0;
    plan.used = true;
    plan.enabled = false;
    snprintf(plan.name, sizeof(plan.name), "新计划");
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        plan.startTimes[i].enabled = i == 0;
        plan.startTimes[i].minuteOfDay = i == 0 ? 7U * 60U : kInvalidMinuteOfDay;
    }
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        plan.zoneDurationSec[i] = 0;
    }

    Esp32BaseWeb::sendHeader("创建计划");
    Esp32BaseWeb::sendPageTitle("创建计划", "每日启动时间和各水路时长");
    Esp32BaseWeb::beginPanel("计划信息");
    sendPlanEditForm(plan, "/irrigation/plans/create", true);
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handlePlanEditPage() {
    uint8_t planId = 0;
    if (!readRequestPlanId(planId)) {
        Esp32BaseWeb::sendText(400, "计划编号无效");
        return;
    }
    const WateringPlan* plan = PlanService::find(planId);
    if (plan == nullptr) {
        Esp32BaseWeb::sendText(404, PlanService::lastError());
        return;
    }

    Esp32BaseWeb::sendHeader(plan->name);
    Esp32BaseWeb::sendPageTitle(plan->name, "每日启动时间和各水路时长");
    Esp32BaseWeb::beginPanel("计划信息");
    sendPlanEditForm(*plan, "/irrigation/plans/save", false);
    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans/delete' onsubmit=\"return confirm('确认删除这个计划？')\"><input type='hidden' name='id' value='");
    char id[8];
    snprintf(id, sizeof(id), "%u", plan->id);
    Esp32BaseWeb::sendChunk(id);
    Esp32BaseWeb::sendChunk("'><div class='ir-danger-line'><input class='danger' type='submit' value='删除计划'></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleSettingsPage() {
    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::sendHeader("设置");
    Esp32BaseWeb::sendPageTitle("设置", "水源、流量保护和电磁阀驱动");
    if (RunController::busy()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设置已锁定", "请先停止当前浇水任务，再保存全局设置。");
    }

    Esp32BaseWeb::beginPanel("全局设置");
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/settings/save'>");

    sendSectionStart("水源与自吸泵", "自吸泵是可选能力；低液位保护只在启用自吸泵时参与防干抽。");
    sendSettingToggle("自吸泵联动",
                      "启用后，浇水运行时输出干接点控制信号给外部自吸泵继电器模块。",
                      "pumpEnabled",
                      config.supply.pumpEnabled);
    sendSettingNumber("自吸泵启动延时",
                      "打开水路和自吸泵控制信号后，等待水压建立再进入流量判断。",
                      "ms",
                      "pumpStartDelayMs",
                      config.supply.pumpStartDelayMs,
                      0,
                      10000);
    sendSettingNumber("自吸泵停止延时",
                      "浇水结束时保留的停止缓冲时间，用于降低频繁切换带来的冲击。",
                      "ms",
                      "pumpStopDelayMs",
                      config.supply.pumpStopDelayMs,
                      0,
                      10000);
    sendSettingToggle("低液位保护",
                      "启用后，当低液位输入触发时停止自吸泵，避免水箱缺水干抽。",
                      "lowLevelEnabled",
                      config.supply.lowLevelEnabled);
    sendSettingToggle("低液位触点类型",
                      "启用表示常闭触点，禁用表示常开触点；按实际缺水传感器接线选择。",
                      "lowLevelNormallyClosed",
                      config.supply.lowLevelContactType == ContactType::NormallyClosed);
    sendSettingNumber("低液位消抖时间",
                      "输入信号需要持续稳定这么久才会被认为有效，避免触点抖动误触发。",
                      "ms",
                      "lowLevelDebounceMs",
                      config.supply.lowLevelDebounceMs,
                      0,
                      10000);
    sendSectionEnd();

    sendSectionStart("流量检测", "流量计为必配输入，用于校准、无流量保护、漏水检测和异常流量判断。");
    sendSettingNumber("流量计每升脉冲数",
                      "流量计每流过 1 升水产生的脉冲数量；未校准时自动计划不能执行。",
                      "脉冲/L",
                      "pulsesPerLiter",
                      config.flow.pulsesPerLiter,
                      0,
                      100000);
    sendSettingNumber("启动流量宽限时间",
                      "水路刚打开后暂不判断无流量，给管路充水和流量稳定留出时间。",
                      "秒",
                      "startupGraceSec",
                      config.flow.startupGraceSec,
                      0,
                      120);
    sendSettingNumber("无流量确认时间",
                      "超过宽限期后，连续这么久没有有效流量才停止运行。",
                      "秒",
                      "noFlowConfirmSec",
                      config.flow.noFlowConfirmSec,
                      1,
                      600);
    sendSettingNumber("待机漏水检测窗口",
                      "系统空闲时累计流量脉冲的观察窗口，用于发现疑似漏水。",
                      "秒",
                      "leakWindowSec",
                      config.flow.leakWindowSec,
                      1,
                      600);
    sendSettingNumber("待机漏水脉冲阈值",
                      "空闲观察窗口内达到该脉冲数，即认为存在异常流动。",
                      "脉冲",
                      "leakPulseThreshold",
                      config.flow.leakPulseThreshold,
                      1,
                      1000);
    sendSettingNumber("低流量阈值",
                      "运行流量低于水路标准流量的该比例时，判定为低流量异常。",
                      "%",
                      "lowFlowPercent",
                      config.flow.lowFlowPercent,
                      1,
                      100);
    sendSettingNumber("高流量阈值",
                      "运行流量高于水路标准流量的该比例时，判定为高流量异常。",
                      "%",
                      "highFlowPercent",
                      config.flow.highFlowPercent,
                      100,
                      1000);
    sendSectionEnd();

    sendSectionStart("电磁阀驱动", "6 路 12V DC 电磁阀为固定输出，驱动参数影响吸合可靠性和发热。");
    sendSettingNumber("电磁阀吸合时间",
                      "打开电磁阀时全功率吸合的持续时间，过短可能打不开，过长会增加发热。",
                      "ms",
                      "pullInMs",
                      config.valve.pullInMs,
                      50,
                      3000);
    sendSettingNumber("电磁阀保持占空比",
                      "电磁阀吸合后使用的保持功率比例，用于降低线圈发热。",
                      "%",
                      "holdPercent",
                      config.valve.holdPercent,
                      1,
                      100);
    sendSettingNumber("单路最大时长",
                      "任何手动任务或计划中，单个水路允许设置的最大运行时间。",
                      "分钟",
                      "maxZoneDurationMin",
                      config.valve.maxZoneDurationSec / 60UL,
                      1,
                      360);
    sendSectionEnd();

    Esp32BaseWeb::sendChunk("<div class='actions'><input type='submit' value='保存设置'");
    if (RunController::busy()) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void sendEnabledZoneSelect(uint8_t selectedZoneId) {
    Esp32BaseWeb::sendChunk("<select name='zone'>");
    const IrrigationConfig& config = ConfigStore::config();
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        char buf[80];
        snprintf(buf, sizeof(buf), "<option value='%u'%s>水路 %u ",
                 zone.id,
                 zone.id == selectedZoneId ? " selected" : "",
                 zone.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select>");
}

void sendCalibrationStartForm(const char* title, const char* action, uint32_t defaultMinutes) {
    Esp32BaseWeb::beginPanel(title);
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='");
    Esp32BaseWeb::sendChunk(action);
    Esp32BaseWeb::sendChunk("'><div class='ir-grid'><div class='ir-field'><label>水路</label><span class='ir-help'>选择一个已启用水路进行校准。</span>");
    sendEnabledZoneSelect(1);
    Esp32BaseWeb::sendChunk("</div><div class='ir-field'><label>运行时长</label><span class='ir-help'>校准会打开所选水路并累计流量计脉冲。</span><div class='ir-input-unit'>");
    sendNumberInput("durationMin", defaultMinutes, 1, maxZoneDurationMinutes());
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>分钟</span></div></div></div><div class='actions'><input type='submit' value='启动校准'></div></form>");
    Esp32BaseWeb::endPanel();
}

